doc/src/hibari/images-src/tab1-2x2.dot
//
// Copyright (c) 2005-2010 Gemini Mobile Technologies, Inc.  All rights reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

digraph data_flow {
    {rank=same; BRICK11 BRICK22};
    {rank=same; BRICK12 BRICK21};

    BRICK11 [label="Role: Head\nBrickName: tab1_ch1_b1\nNodeName: 'gdss1@machine-1'"];
    BRICK12 [label="Role: Tail\nBrickName: tab1_ch1_b2\nNodeName: 'gdss1@machine-2'"];
    BRICK21 [label="Role: Head\nBrickName: tab1_ch2_b1\nNodeName: 'gdss1@machine-2'"];
    BRICK22 [label="Role: Tail\nBrickName: tab1_ch2_b2\nNodeName: 'gdss1@machine-1'"];

    BRICK11 -> BRICK12 [label="Replication"];
    BRICK21 -> BRICK22 [label="Replication"];
};
